cask_args appdir: "/Applications", require_sha: true

# Basic setup of dependencies
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
brew "mas"

# Mac App Store
mas "DaisyDisk", id: 411643860
mas "Magnet", id: 441258766
mas "Microsoft Remote Desktop", id: 1295203466
mas "Parcel", id: 639968404
mas "Pi Stats", id: 1514075262
mas "Pixelmator Pro", id: 1289583905
mas "Soulver 3", id: 1508732804
mas "Todoist", id: 585829637

# Direct Download Applications
cask "1Password"
cask "android-studio"
cask "bartender"
cask "choosy"
cask "deckset"
cask "figma"
cask "google-chrome"
cask "kaleidoscope"
cask "microsoft-edge"
cask "mimestream"
# cask "onedrive"
cask "postman"
cask "slack"
cask "spotify"
cask "timely"
cask "tower"
cask "visual-studio-code"

# iOS Development
brew "carthage"
brew "swiftlint"
brew "fastlane"

# Flutter Development
tap "leoafarias/fvm"
brew "fvm"
brew "cocoapods"
brew "usbmuxd", args: ["HEAD"]
brew "libimobiledevice", args: ["HEAD"]
brew "ideviceinstaller"
brew "ios-deploy"

# Ruby
brew "rbenv"
