cask_args appdir: "/Applications", require_sha: true

# Basic setup of dependencies
tap "homebrew/bundle"
#tap "homebrew/cask-fonts"
brew "mas"

# Mac App Store
mas "CrystalFetch", id: 6454431289
mas "DaisyDisk", id: 411643860
mas "Developer", id: 640199958
mas "Labelife", id: 1560922539
mas "Parcel", id: 375589283
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 6475002485
mas "Soulver 3", id: 1508732804
mas "Telegram", id: 747648890
mas "Tripsy", id: 1429967544
mas "UTM", id: 1538878817
mas "Velja", id: 1607635845
mas "Windows App", id: 1295203466

# Direct Download Applications
cask "1Password"
cask "android-studio"
cask "bambu-studio"
cask "cakebrew"
cask "chatgpt"
cask "cleanmymac"
cask "cleanshot"
cask "deskpad"
cask "discord"
cask "element"
cask "elgato-stream-deck"
cask "figma"
cask "google-chrome"
cask "kaleidoscope"
cask "latest"
cask "logi-options-plus"
cask "microsoft-teams"
cask "mimestream"
cask "notion"
cask "postman"
cask "rocket"
cask "slack"
cask "spotify"
cask "tower"
cask "vanilla"
cask "visual-studio-code"
cask "zoom"

# iOS Development
brew "carthage"
brew "swiftlint"
brew "fastlane"

# Flutter Development
tap "leoafarias/fvm"
brew "fvm"

# Ruby
brew "rbenv"

# Node
brew "node"

# Things for video transcoding
brew "handbrake"
brew "ffmpeg"
brew "mkvtoolnix"
brew "mp4v2"
brew "mpv"
